export const fear = {
  dog_name: '옥자',
  dog_age: 5,
  slug: 'bDGlFYdZ',
  image: `${process.env.REACT_APP_SERVER_URL}/media/dog8.png`,
  dog_emotion: '두려움',
  dog_emotion_percentage: '68.10',
  dog_coordinate: '414,143,652,383',
  human_emotion: '기쁨',
  human_emotion_percentage: '80.00',
  human_coordinate: '443,222,672,433',
  chemistry_percentage: '39.85',
  solution: [
    {
      id: 7,
      sort_order: 3,
      content: '6-10시간',
      solution:
        '오늘 하루 옥자와 시간을 많이 못 보내셨군요. 옥자가 반려인님만을 애타게 기다렸을 것 같네요. 앞으로 옥자가 외롭지 않게 시간을 더 함께 보내주세요!',
    },
    {
      id: 12,
      sort_order: 4,
      content: '안 함',
      solution:
        '옥자가 정말 답답하고 찌뿌둥하겠네요. 산책은 강아지에게 필수 활동입니다! 산책만으로 강아지의 몸과 정신 건강을 증진 시킬 수 있으며 산책을 안 할 시 강아지는 심각한 우울감을 느낍니다. 내일은 꼭 긴 산책을 통해 옥자가 행복과 개운함을 느끼게 해주세요!',
    },
    {
      id: 15,
      sort_order: 3,
      content: '4번 이상',
      solution:
        '옥자가 오늘 간식을 많이 먹었네요! 간식을 너무 많이 먹는 것은 해로울 수 있습니다. 옥자의 식습관과 건강이 망가지지 않도록 주의해 주세요!',
    },
  ],
  needs: [
    {
      choice: 12,
      name: '산책',
      description:
        '산책할 때 볼 일을 해결하려는 강아지들이 많은데요, 매너 있는 반려인이 되기 위해 배변 봉투를 챙겨주세요!!',
    },
    {
      choice: 15,
      name: '간식',
      description:
        '포도, 양파, 마늘, 커피, 마카다미아, 자일리톨, 초콜릿 등은 강아지에게 알레르기와 같은 문제를 일으킬 수 있어요! 조심해주세요~',
    },
    {
      choice: 7,
      name: '놀이',
      description:
        '앉아 훈련에 도전해보세요. 서두르지 않고 충분한 시간을 가지면서 옥자가 편안함을 느끼는 훈련 환경을 만들어 주세요.',
    },
  ],
  dog_emotion_description:
    '강아지의 공격성은 겁에 질린 상태일 때 가장 크게 나타나요. 야생동물과 다르게 집에서 기르는 강아지는 도망갈 곳이 없기 때문에 위협을 느끼면 맞서 싸워요. 우선, 강아지가 이빨을 보인다면 거리를 두는 것이 좋아요. 위협이 되지 않도록 서 있기 보다는 옆으로 누워서 놀아주세요. 또 강아지는 소리에 민감하기 때문에 방어적인 산책을 해주는 것도 도움이 돼요. 훈련에 의한 사회화 역시 도움이 된답니다.',
};

export const angry = {
  dog_name: '옥자',
  dog_age: 5,
  slug: 'FBiZXe1L',
  image: `${process.env.REACT_APP_SERVER_URL}/media/dog1.png`,
  dog_emotion: '화남',
  dog_emotion_percentage: '37.10',
  dog_coordinate: '414,143,652,383',
  human_emotion: '기쁨',
  human_emotion_percentage: '80.00',
  human_coordinate: '443,222,672,433',
  chemistry_percentage: '31.85',
  solution: [
    {
      id: 7,
      sort_order: 3,
      content: '2시간 이하',
      solution:
        '옥자가 최서연님과 함께 보낸 오늘은 정말 아늑하고 행복한 하루였겠네요. 앞으로도 소중한 추억 많이 만들어주세요!',
    },
    {
      id: 12,
      sort_order: 4,
      content: '안 함',
      solution:
        '옥자가 정말 답답하고 찌뿌둥하겠네요. 산책은 강아지에게 필수 활동입니다! 산책만으로 강아지의 몸과 정신 건강을 증진 시킬 수 있으며 산책을 안 할 시 강아지는 심각한 우울감을 느낍니다. 내일은 꼭 긴 산책을 통해 옥자가 행복과 개운함을 느끼게 해주세요!',
    },
    {
      id: 15,
      sort_order: 3,
      content: '안 줌',
      solution:
        '옥자가 맛있는 간식이 고팠을 것 같네요. 건강한 간식은 옥자의 치아, 영양소, 정신과 성격 등에 긍정적인 효과를 가져옴은 물론이며 최서연님과의 관계도 더 돈독하게 해줍니다. 내일부터 옥자가 착한 일을 했을 때 간식 한 개로 꼭 옥자에게 행복을 선물해 주세요.',
    },
  ],
  needs: [
    {
      choice: 7,
      name: '놀이',
      description:
        '앉아 훈련에 도전해보세요. 서두르지 않고 충분한 시간을 가지면서 옥자가 편안함을 느끼는 훈련 환경을 만들어 주세요.',
    },
    {
      choice: 10,
      name: '산책',
      description:
        '이상적인 강아지들의 산책 시간으로는 하루 3~4번, 30분~1시간이 적당해요. 대형견은 2시간정도 해주는 것이 좋답니다.',
    },
    {
      choice: 16,
      name: '간식',
      description:
        '강아지에게 수제 간식을 만들어 주는 것은 유대감 형성에 좋을 수 있어요. 강아지에게 좋은 수제 간식으로는 체내 흡수율이 좋은 두부, 기력회복에 좋은 복어, 모질개선에 좋은 연어, 면역력 강화에 좋은 고구마가 있어요.',
    },
  ],
  dog_emotion_description:
    '최서연님은 옥자가 평소 스트레스를 많이 받는다는 사실을 알고 있어요(카밍 시그널을 알아채고 있어요). 다음과 같은 시그널이 있으면 반려견이 스트레스를 많이 받고 있거나 화가 난 거예요. 식욕이 없어진다, 짖거나 으르렁거린다. 바닥이나 벽, 가구 등을 긁는다, 설사나 구토를 한다, 한숨을 쉬거나 하품을 한다, 가만히 있지 못한다, 면역력이 약해진다. 눈을 마주치지 않는다. 머리를 흔들거나 헉헉거린다.. 계속 자신의 신체를 핥는다. 위 사항 중 한 가지라도 두드러지는 신호가 있다면 더 자세한 솔루션을 드릴게요!',
};

export const sad = {
  created_at: '2022-03-13T07:46:42.280078+09:00',
  dog_name: '옥자',
  dog_age: 7,
  slug: 'OljvOkhg',
  image: `${process.env.REACT_APP_SERVER_URL}/media/dog2.png`,
  dog_emotion: '슬픔',
  dog_emotion_percentage: '80.39',
  dog_coordinate: '1,1,299,312',
  human_emotion: '기쁨',
  human_emotion_percentage: '80.00',
  human_coordinate: '443,222,672,433',
  chemistry_percentage: '39.85',
  solution: [
    {
      id: 7,
      sort_order: 3,
      content: '6-10시간',
      solution:
        '오늘 하루 옥자와 시간을 많이 못 보내셨군요. 옥자가 최서연님만을 애타게 기다렸을 것 같네요. 앞으로 옥자가 외롭지 않게 시간을 더 함께 보내주세요!',
    },
    {
      id: 9,
      sort_order: 1,
      content: '1번',
      solution:
        '옥자에게 숨통이 트이는 산책이었겠네요. 강아지에게 산책은 필수인 만큼 틈틈이 옥자와 산책을 더 하시길 바랍니다!',
    },
    {
      id: 15,
      sort_order: 3,
      content: '4번 이상',
      solution:
        '옥자가 오늘 간식을 많이 먹었네요! 간식을 너무 많이 먹는 것은 해로울 수 있습니다. 옥자의 식습관과 건강이 망가지지 않도록 주의해 주세요!',
    },
  ],
  needs: [
    {
      choice: 7,
      name: '놀이',
      description:
        '가져와 훈련에 도전해 보세요. 볼펜같이 특정 소리가 나는 물건이 있으면 더 쉬워요. 우선 물건을 강아지 앞에 두어서 관심을 가지면 볼펜 소리(클릭)를 내고 간식으로 보상을 주세요. 그다음 강아지가 관심을 가지고 물건을 물려고 하면 역시 클릭 후 보상을 주세요. 이후 물건을 멀리 두고 “가져와”를 외쳐보세요. 강아지가 물건을 가져오면 클릭 후 보상을 주세요.',
    },
    {
      choice: 9,
      name: '산책',
      description:
        '이상적인 강아지들의 산책 시간으로는 하루 3~4번, 30분~1시간이 적당해요. 대형견은 2시간 정도 해주는 것이 좋답니다.',
    },
    {
      choice: 15,
      name: '간식',
      description:
        '강아지에게 수제 간식을 만들어 주는 것은 유대감 형성에 좋을 수 있어요. 강아지에게 좋은 수제 간식으로는 체내 흡수율이 좋은 두부, 기력 회복에 좋은 복어, 모질 개선에 좋은 연어, 면역력 강화에 좋은 고구마가 있어요~',
    },
  ],
  dog_emotion_description:
    '옥자에 대한 최서연님의 관심이 더 필요해요. 옥자는 사료뿐만 아니라 최서연님의 사랑도 먹고 자라요. 함께 보내는 시간을 더 늘려야 되요. 시간 을 내기 힘들다면,규칙적인 라이프 스타일을 만들어 주세요. 개는 규칙적인 동물이기 때문에 산책, 놀이, 반려인의 외출 등 정해진 일과를 만들어 주면 반려인이 집을 비우는 시간에 크게 상관없이 안정감을 느껴요. 규칙적인 산책시간을 가져서 옥자에게 활력을 불어넣어 주세요. 옥자에게 수제 간식을 만들어주어 옥자가 더 많은 영양분 을 흡수할 수 있게 해주세요. 또, 치아관리를 받는 반려동물은 그러지 않은 반려동물보다 평균 수명이 20% 높다고 해요!',
};

export const happy = {
  dog_name: '옥자',
  dog_age: 5,
  slug: 'lsEFHAp',
  image: `${process.env.REACT_APP_SERVER_URL}/media/%E1%84%89%E1%85%B3%E1%84%8F%E1%85%B3%E1%84%85%E1%85%B5%E1%86%AB%E1%84%89%E1%85%A3%E1%86%BA_2022-03-13_%E1%84%8B%E1%85%A9%E1%84%8C%E1%85%A5%E1%86%AB_8.23.34.png`,
  dog_emotion: '기쁨',
  dog_emotion_percentage: '99.0',
  dog_coordinate: '414,143,652,383',
  human_emotion: '기쁨',
  human_emotion_percentage: '00.0',
  human_coordinate: '443,222,672,433',
  chemistry_percentage: '49.00',
  solution: [
    {
      id: 5,
      sort_order: 1,
      content: '2시간 이하',
      solution:
        '옥자가 최서연님과 함께 보낸 오늘은 정말 아늑하고 행복한 하루였겠네요. 앞으로도 소중한 추억 많이 만들어주세요!',
    },
    {
      id: 10,
      sort_order: 2,
      content: '2번',
      solution:
        '옥자가 산책을 두 번 해서 기분이 정말 좋았겠네요. 앞으로도 옥자와 자주 산책을 하면서 옥자에게 행복을 선물해주세요!',
    },
    {
      id: 14,
      sort_order: 2,
      content: '2-3번',
      solution:
        '옥자가 오늘 간식을 많이 먹었네요! 간식을 너무 많이 먹는 것은 해로울 수 있습니다. 옥자의 식습관과 건강이 망가지지 않도록 주의해 주세요!',
    },
  ],
  needs: [
    {
      choice: 15,
      name: '간식',
      description:
        '강아지에게 수제 간식을 만들어 주는 것은 유대감 형성에 좋을 수 있어요. 강아지에게 좋은 수제 간식으로는 체내 흡수율이 좋은 두부, 기력 회복에 좋은 복어, 모질 개선에 좋은 연어, 면역력 강화에 좋은 고구마가 있어요~',
    },
    {
      choice: 12,
      name: '산책',
      description:
        '산책을 통해 강아지의 분리불안 증상이 호전되고 스트레스를 완화시킬 수 있어요. 사회성 발달의 효과까지 볼 수 있답니다-!',
    },
    {
      choice: 5,
      name: '놀이',
      description:
        '강아지가 특정 냄새를 찾아 내는 놀이를 노즈워크 라고 합니다. 강아지가 못 보는 장소에 강아지가 좋아하는 간식을 평소에 강아지가 좋아하는 장난감 안에 넣고 찾게 해보세요. 노즈워크를 통해 주인과의 유대감이 형성되고 사회성이 높아질 수 있습니다.',
    },
  ],
  dog_emotion_description:
    '최서연님은 평소 옥자에게 관심이 많고 잘 챙겨줘요. 옥자는 5년간 최서연님의 든든한 동반자 였어요. 최서연님의 사랑 덕분에 옥자는 밝고 활기찬 성격을 가지게 되었어요. 최서연님 역시 옥자가 최서연님에게 활력소 역할을 하면서 규칙적인 생활을 하고 의욕을 얻고 있어요. 지금처럼 옥자와의 시간을 보내면서 행복한 생활을 이어나가 주세요.',
};
